---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipeFrictionFactorService
source: html/c121c2bf-1a7c-c3b2-4f44-b51ec6b7cae6.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipeFrictionFactorService Property

Pipe friction factor service id

## Syntax (C#)
```csharp
public static ExternalServiceId PipeFrictionFactorService { get; }
```